# s1 = "Даниил"
# s2 = 'Николаев'
# s3 = "Даниил\nНиколаев"

# многострочная строка
# s3 = """
# Даниил
# Николаев
# """
# print(s3)

#
# print(s3)
# a = ""

# конкатинация строк. Конкатинировать можно только строки (не integer)
# s4 = s1 + " " + s2 + str(a)
# s4 = (s1 + " ") * 3
# s4 = len(a)
# print(s4)
#
# print(s1 in s3) # Проверяем, находится ли "Даниил" в s 3 -> True
# print("Даниил" == s3)
#
# a = "абвг"
# b = "авг"
# print(a>b)
#
# print(ord("а"))
# print(ord("б"))
# print(ord("в"))
# print(a<b)

a = "2312"
print(type(int(a)))

# проверка вхождения строки в строку
s1 = "Лидия"
s2 = "Ланкова"
# print("Ланкова" in s2)
print (s1 in s2)

print(ord("a"))